## 예제 1-7 브로드캐스팅과 백터화 연산

In [2]:
import pandas as pd

In [12]:
# 방법1
data = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
df = pd.DataFrame(data,
                 columns = list('abc'))
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [3]:
# 방법2
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                 columns = list('abc'))

In [4]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
df + 3

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [6]:
df1 = pd.DataFrame([[3,3,3],[3,3,3],[3,3,3]],
                  columns = list('abc'))

In [7]:
df1

   a  b  c
0  3  3  3
1  3  3  3
2  3  3  3

In [8]:
# 브로드캐스팅 .. 전체 모든 열이 +3 된다.
df + 3

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [9]:
# df + 3한 값과 같은 값이 출력된다.
df + df1

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [10]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
df1

   a  b  c
0  3  3  3
1  3  3  3
2  3  3  3